//Задача 64: Задайте значение N. Напишите программу,
//которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
/*
void ShowNums(int number)
{
    Console.Write(number + " ");
    if(number > 1) ShowNums(number - 1);
    
}
Console.Write("Input number: ");
int userNumber = Convert.ToInt32(Console.ReadLine());
ShowNums(userNumber);
*/

